app/views/OWS/Membership/FetchEnrollmentCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:mem="http://webservices.micros.com/ows/5.1/Membership.wsdl">
  <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <mem:FetchEnrollmentCodeRequest>
         <mem:MembershipId>{MembershipId}</mem:MembershipId>
      </mem:FetchEnrollmentCodeRequest>
   </soapenv:Body>
</soapenv:Envelope>